package com.jinshu.xuzhi.learnchinese;

import android.content.ContentValues;
import android.content.Context;
import android.database.Cursor;
import android.os.AsyncTask;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentActivity;
import android.support.v4.app.FragmentManager;
import android.support.v4.app.FragmentTransaction;
import android.util.Log;
import android.view.ViewGroup;
import android.widget.ImageView;

import com.jinshu.xuzhi.learnchinese.data.LearnChineseContract;
import com.jinshu.xuzhi.learnchinese.data.LearnChineseDbHelper;

import java.util.ArrayList;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * Created by xuzhi on 2016/5/26.
 */
public class TaskGenerateDefaultLearningList extends AsyncTask<String, Void, Void> {
    private final String LOG_TAG = this.getClass().getSimpleName();

    private final Context mContext;
    private final FragmentActivity mActivity;

    public TaskGenerateDefaultLearningList(FragmentActivity context) {
        mContext = context;
        mActivity = context;

    }

    @Override
    protected Void doInBackground(String... params) {


        LearningList[] list = GenerateDefaultLearningList();
        LearnChineseDbHelper myDbHelper = new LearnChineseDbHelper(mContext);
        int learnedCharactersNum = 0;/*一条学习内容中已学会的汉字总数*/
        String pureContent;/*学习条目中的纯汉字内容*/
        String contentFlag ;/*学习条目中汉字对应显示标签 0-黑色 未学会，1-绿色 已学会，2-粉色 字库无*/
        for (int i = 0;i < list.length;i++) {
            pureContent = com.jinshu.xuzhi.learnchinese.Utility.generateCharacterName(list[i].content);
            Cursor cursor = myDbHelper.getCharactersByNameList(pureContent);

            if ((cursor == null)||(cursor.getCount() == 0))
            {
                Log.v(LOG_TAG, "invalid cursor");
                cursor.close();
                continue;
            }
            learnedCharactersNum = 0;
            contentFlag = com.jinshu.xuzhi.learnchinese.Utility.getContentTag(pureContent);
            StringBuilder builder = new StringBuilder(contentFlag);

            cursor.moveToFirst();

            List characterPositionArray;/*已学会汉字在contentflag中对应位置*/
            for (int j = 0;j < cursor.getCount();j++)
            {
                String readFlag = cursor.getString(cursor.getColumnIndex(LearnChineseContract.Character.COLUMN_READ));
                String character = cursor.getString(cursor.getColumnIndex(LearnChineseContract.Character.COLUMN_NAME));
                Log.v(LOG_TAG,"character = " + character);
                characterPositionArray = getPositionByCharacter(character, pureContent);

                if (readFlag.equals(LearnChineseContract.YES)) {
                    learnedCharactersNum++;
                }
                char c = readFlag.equals(LearnChineseContract.YES)?'1':'0';
                for (int k = 0;k< characterPositionArray.size();k++)
                {
                    builder.setCharAt((int)characterPositionArray.get(k), c);
                }
                cursor.moveToNext();
            }
            contentFlag = builder.toString();
            cursor.close();
            ContentValues value = new ContentValues();
            value.put(LearnChineseContract.CustomLearning.COLUMN_NAME, list[i].name);
            value.put(LearnChineseContract.CustomLearning.COLUMN_DATE, com.jinshu.xuzhi.learnchinese.Utility.getCurrentDate());
            value.put(LearnChineseContract.CustomLearning.COLUMN_CONTENT, list[i].content);
            value.put(LearnChineseContract.CustomLearning.COLUMN_STATUS, (learnedCharactersNum == pureContent.length())?LearnChineseContract.FINISHED:LearnChineseContract.NO);
            value.put(LearnChineseContract.CustomLearning.COLUMN_CHARACTER_SEQUENCE, list[i].characterIdSequence);
            value.put(LearnChineseContract.CustomLearning.COLUMN_PERCENTAGE, Integer.toString(learnedCharactersNum)+ "/" + Integer.toString(pureContent.length()));
            value.put(LearnChineseContract.CustomLearning.COLUMN_CONTENT_TAG, contentFlag);
            Log.v(LOG_TAG,"content = " + list[i].content + ",PERCENTAGE = " + Integer.toString(learnedCharactersNum)+ "/" + Integer.toString(pureContent.length()) + ",contentFlag = " + contentFlag);
            mContext.getContentResolver().insert(LearnChineseContract.CustomLearning.CONTENT_URI, value);

        }
        myDbHelper.close();
        return null;
    }
    class LearningList
    {
        String name;
        String content;
        String characterIdSequence;
        LearningList(String t_name,String t_content,String t_characterIdSequence)
        {
            name = t_name;
            content = t_content;
            characterIdSequence = t_characterIdSequence;
        }
    };
    public LearningList[]   GenerateDefaultLearningList()
    {
        LearningList[] primarySchool = new LearningList[6];
        primarySchool[0] = new LearningList("小学一年级常用汉字生字表",
                "一、二、三、十、木、禾、上、下、土、个、八、入、大、天、人、火、文、六、七、儿、九、无、口、日、中、了、子、门、月、不、开、四、五、目、耳、头、米、见、白、田、电、也、长、山、出、飞、马、鸟、云、公、车、牛、羊、小、少、巾、牙、尺、毛、卜、又、心、风、力、手、水、广、升、足、走、方、半、巴、业、本、平、书、自、已、东、西、回、片、皮、生、里、果、几、用、鱼、今、正、雨、两、瓜、衣、来、年、左、右、万、百、丁、齐、冬、说、友、话、春、朋、高、你、绿、们、花、红、草、爷、亲、节、的、岁、行、古、处、声、知、多、忙、洗、真、认、父、扫、母、爸、写、全、完、关、家、看、笑、着、兴、画、会、妈、合、奶、放、午、收、女、气、太、早、去、亮、和、李、语、秀、千、香、听、远、唱、定、连、向、以、更、后、意、主、总、先、起、干、明、赶、净、同、专、工、才、级、队、蚂、蚁、前、房、空、网、诗、黄、林、闭、童、立、是、我、朵、叶、美、机、她、过、他、时、送、让、吗、往、吧、得、虫、很、河、借、姐、呢、呀、哪、谁、凉、怕、量、跟、最、园、脸、因、阳、为、光、可、法、石、找、办、许、别、那、到、都、吓、叫、再、做、象、点、像、照、沙、海、桥、军、竹、苗、井、面、乡、忘、想、念、王、这、从、进、边、道、贝、男、原、爱、虾、跑、吹、乐、地、老、快、师、短、淡、对、热、冷、情、拉、活、把、种、给、吃、练、学、习、非、苦、常、问、伴、间、共、伙、汽、分、要、没、孩、位、选、北、湖、南、秋、江、只、帮、星、请、雪、就、球、跳、玩、桃、树、刚、兰、座、各、带、坐、急、名、发、成、动、晚、新、有、么、在、变、什、条、",
                "77,1007,230,224,660,1124,66,117,603,9,625,306,32,120,22,81,210,671,752,172,866,152,269,1,20,41,25,256,2,27,148,332,412,341,835,52,481,204,275,1109,253,108,171,315,107,368,274,949,839,214,227,755,1250,10,263,1024,802,1077,545,1017,87,126,85,206,163,246,611,991,475,222,167,447,415,356,213,297,244,112,195,287,220,173,361,562,88,110,221,211,141,765,349,202,709,188,1131,488,94,100,799,782,54,437,1015,1245,1137,99,299,199,84,420,194,98,2628,93,281,435,76,1230,196,487,19,55,164,468,290,58,185,123,700,861,237,303,23,1168,292,436,272,38,348,300,115,131,43,101,450,393,114,325,378,989,301,787,457,157,14,40,400,121,628,104,645,7,1388,511,639,260,336,735,212,413,226,113,285,111,165,254,150,268,28,371,62,806,1690,162,577,232,241,773,427,1885,1884,61,399,355,1205,523,578,386,1248,874,329,8,18,1234,810,149,231,106,119,90,96,449,291,364,312,440,109,1198,179,702,2210,711,343,931,563,513,2276,543,402,552,156,754,498,178,643,97,63,116,182,467,360,465,267,236,103,95,130,1197,321,243,216,330,209,247,464,736,258,2127,309,1210,1541,1038,155,73,655,145,540,353,92,151,53,319,144,719,318,75,176,1883,627,86,283,65,177,16,328,837,2570,26,448,717,153,286,201,139,147,180,324,880,127,599,359,403,200,205,961,183,544,969,781,175,105,134,218,174,499,426,2834,485,980,978,136,729,3,48,721,102,390,668,42,2130,506,569,539,623,375,39,407,677,181,132,135,166,388,239,91,128,89,326,187,342");
        primarySchool[1] = new LearningList("小学二年级常用汉字生字表",
                "宜、实、色、华、谷、金、尽、层、丰、壮、波、浪、灯、作、字、苹、丽、劳、尤、其、区、巨、它、安、块、站、已、甲、豆、识、纷、经、如、好、娃、洼、于、首、枝、枫、记、刘、胡、戏、棋、钢、观、弹、琴、养、休、伸、甜、歌、院、除、息、您、牵、困、员、青、宁、室、样、校、切、教、响、班、欠、元、包、钟、叹、哈、迟、闹、及、身、仔、细、次、外、计、怦、礼、加、夕、与、川、州、台、争、民、族、亿、洁、欢、祖、旗、帜、庆、曲、央、交、市、旁、优、阴、坛、城、国、图、申、匹、互、京、泪、洋、拥、抱、相、扬、讲、打、指、接、惊、故、侯、奇、寸、落、补、拔、功、助、取、所、信、沿、拾、际、蛙、错、答、还、言、每、治、棵、挂、哇、怪、慢、怎、思、穿、弯、比、服、浅、漂、啦、啊、夫、表、示、号、汗、伤、吸、极、串、免、告、诉、狐、狸、猴、颗、斤、折、挑、根、独、满、容、易、采、背、板、椅、但、傍、清、消、由、术、吐、注、课、铅、笔、桌、景、拿、坏、松、扎、抓、祝、福、句、幸、之、令、布、直、当、第、现、期、轮、路、丑、永、饥、饱、温、贫、富、户、亚、角、周、床、病、始、张、寻、哭、良、食、双、体、操、场、份、粉、昨、晴、姑、娘、妹、读、舟、乘、音、客、何、汪、丛、牢、拍、护、保、物、鸡、猫、羽、领、捉、理、跃、蹦、灵、晨、失、觉、扔、掉、眼、睛、纸、船、久、乎、至、死、腰、捡、粒、被、并、夜、喜、重、味、轻、刻、群、卫、运、宇、宙、航、舰、冲、晒、池、浮、灾、害、黑、器、岸、纹、洞、影、倒、游、圆、围、杯、件、住、须、能、飘、必、事、历、史、灭、克、化、代、孙、植、厂、产、介、农、科、技、纺、织、脱、冻、溪、棉、探、摇、野、躲、解、未、追、店、枯、徐、烧、荣、菜、宿、冈、世、界、轰、笋、芽、喊、呼、唤、弟、哥、骨、抽、拐、浇、终、静、躺、谢、渐、微、瓦、泉、然、结、股、脆、塔、杜、鹃、冒、雷、迈、迷、迹、叔、锋、滴、洒、泥、泞、扑、托、摸、利、铃、弱、末、芬、芳、夏、应、该、岛、展、建、纱、环、绕、胜、隐、约、省、茂、盛、吾、季、留、杏、密、蜜、坡、搭、摘、钉、沟、龙、寿、泼、敬、脚、凤、束、府、夺、扮、伟、够、恩、柏、特、鲜、度、凰、色、勾、单、宫、雄、烁、辉、另、题、漫、哄、骗、尔、仍、便、票、式、且、煌、志、提、朗、喝、刀、求、使、英、整、而、丹、乌、显、丝、眨、陈、斜、含、炉、鸣、银、泊、柳、艺、忽、杆、涛、转、吴、窗、岭、绝、烟、流、垂、乱、压、越、彩、蝉、蛛、岩、趴、刨、陆、质、厚、沉、逃、阵、虹、蜘、蛛、册、宝、印、埋、铁、底、导、盏、稠、针、稀、碰、兄、商、挤、决、钱、批、报、破、碎、滑、继、续、封、骄、傲、拎、桶、停、聪、胳、膊、甸、晃、荡、叭、玲、狗、糟、梯、楼、肯、脑、筋、讶、谈、望、算、此、桩、肥、灰、讨、厌、冰、蛋、壳、鸭、欺、负、鹅、翅、膀、勺、斗、玉、组、珍、珠、数、钻、研、睡、距、离、油、检、查、团、斥、责、炎、夸、奖、亡、肉、耐、谜、传、染、类、严、寒",
                "1730,225,284,469,1403,323,83,911,1037,1240,672,986,891,146,295,1540,483,759,1044,197,47,892,169,37,579,489,195,1106,1348,441,1497,170,137,36,2040,1995,125,458,1551,1556,289,954,811,823,1000,1907,431,850,893,638,919,1393,2481,572,401,626,547,472,1854,953,266,425,1143,554,143,600,357,279,573,662,1066,365,15,542,1117,1891,1475,1694,397,191,1129,576,189,217,471,3505,575,252,1028,24,1026,690,423,501,311,739,1027,1996,373,838,3183,1612,1243,697,1111,384,446,749,947,1270,1290,495,21,567,1107,1045,1048,636,745,783,927,767,219,1169,460,238,377,304,497,72,1937,416,1023,432,1465,1510,548,648,463,161,228,1711,1803,641,2739,622,409,140,370,234,536,2686,1786,1872,775,731,358,71,553,1968,240,1670,1705,3193,2441,724,29,261,508,558,1251,507,791,454,1369,894,305,480,1674,2249,2813,3137,1058,1303,1804,459,524,334,453,555,862,688,694,2684,158,2792,352,527,270,444,1196,592,948,2196,593,936,871,470,885,820,1040,1304,2027,494,546,538,129,438,404,294,133,142,159,168,1578,317,1078,571,1138,1677,633,1659,620,1074,443,695,439,60,344,345,57,776,756,923,588,476,250,3334,296,780,2285,1876,2723,762,605,972,395,1227,2200,339,484,313,1442,1132,1460,883,716,394,233,1489,2522,1274,486,2090,207,2449,3449,582,2436,333,316,1092,635,248,693,644,31,428,429,302,271,3021,2098,2549,193,235,424,366,229,581,340,491,674,825,396,1257,1732,2229,2227,809,2154,1254,2303,1462,686,490,681,1609,1498,2002,434,565,556,2186,713,1552,1223,277,606,122,3244,381,138,496,512,1100,264,354,265,1268,2682,1016,408,1005,879,369,899,1499,1769,878,1424,3058,2689,930,934,80,3015,320,419,794,684,78,5,82,79,982,2592,1051,186,255,1575,2208,1327,950,704,2176,683,12,886,1515,1516,2000,385,521,3290,682,798,604,1049,1933,124,282,1666,2240,2639,1338,2744,33,853,1190,843,971,1580,2767,3195,1998,1718,1714,1089,805,2905,257,2195,2344,1087,1330,1332,952,293,382,916,667,503,1493,895,2057,779,2613,374,1865,1539,997,1347,1629,445,1341,616,3201,1529,2640,3103,1385,1452,1099,1281,1721,2672,580,1071,901,854,1183,1307,1214,650,848,1832,215,964,314,2523,284,1070,535,942,990,1990,2718,502,380,3194,1873,45,208,589,242,774,462,421,3051,520,350,2328,815,1020,351,190,308,461,118,1067,1069,613,801,1871,763,2509,996,1703,1605,940,1710,1834,670,943,1336,2294,479,1359,841,1614,505,725,372,1624,870,855,430,890,3146,2740,1610,1880,1421,1477,701,1846,596,1944,913,1882,3145,2740,1135,768,630,2089,851,618,664,2076,3004,1384,2778,2946,1112,574,1808,391,363,915,298,586,2945,2843,804,703,692,2058,2788,1519,2414,640,3230,2243,3167,1413,2160,1823,1110,1781,918,3435,2413,789,733,570,2786,1260,452,69,529,198,2131,1669,1184,1145,1178,867,2610,1319,2159,44,857,2775,2138,3168,1029,727,1085,689,873,2072,331,2193,661,666,2446,74,844,2411,615,747,1130,792,1702,1182,941,956,816,1852,2604,392,2005,418,651,2861");
        primarySchool[2] = new LearningList("小学三年级常用汉字生字表",
                "坪、坝、戴、招、蝴、蝶、孔、雀、舞、铜、粗、尾、要、装、劲、绒、朝、些、钓、察、瓣、拢、掌、趣、爬、峰、顶、似、苍、仰、咱、奋、辫、勇、居、郊、散、步、胸、脯、渣、或、者、敢、惜、低、诚、基、突、按、摆、弄、准、备、侧、胶、卷、辆、秘、杂、社、著、藏、悄、闪、坑、臣、推、旅、考、秦、纪、遗、究、震、促、深、忆、异、逢、佳、倍、遥、遍、插、精、希、却、依、拼、命、奔、村、抖、丧、磨、坊、扇、枚、邮、爽、柿、仙、梨、菠、萝、粮、紧、杨、艳、内、梦、醒、苏、湿、娇、嫩、强、适、昆、播、修、致、论、试、验、袋、证、概、减、阻、测、括、确、误、途、超、堂、镜、闲、待、阅、腿、随、调、简、拜、访、具、闻、尘、仆、纳、闷、丘、迎、等、止、境、授、品、暗、降、丈、肢、肌、肤、辽、阔、血、液、滋、润、创、造、县、设、参、部、横、跨、举、击、坚、固、栏、案、爪、贵、断、楚、孤、帆、蓝、懒、披、划、威、武、拣、颜、形、状、渔、料、辈、汇、欣、赏、映、挡、视、线、浸、献、药、村、软、刮、舌、矛、盾、集、持、般、架、龟、攻、炮、坦、战、神、兵、退、挖、鞋、斧、锯、免、屋、抢、难、初、管、敌、阶、懂、陶、谦、虚、嘴、恼、怒、吵、感、荒、捧、朴、素、值、受、愿、姿、势、投、况、吞、烈、绪、述、普、通、鼓、励、育、瓶、系、绳、茶、危、险、顺、俩、索、激、堵、获、矛、担、宽、裕、买、猜、糖、即、卡、盼、仁、贴、筝、鹰、端、稳、嚷、橘、墨、斑、闹、宇、宙、荡、衬、赛、拨、警、惕、膝、毫、套、倾、探、扎、搂、贯、局、昼、耘、未、耕、织、桑、蓬、稚、纶、莓、苔、叮、嘱、排、而、幅、却、哈、审、肃、晌、悦、悉、诲、例、芝、卵、匀、寸、呆、增、隔、壁、搬、烛、慈、肩、捧、匠、伟、砌、跨、创、既、毁、固、且、案、智、慧、登、阶、厅、礼、席、灿、烂、党、描、敞、椅、议、宾、翠、秆、绣、腹、赤、衫、疾、泛、泡、脱、锐、晃、饲、贪、狭、桂、刺、软、触、滑、唇、汁、津、腐、虽、味、亭、移、泊、愁、旷、萤、簇、烧、喂、盈、寿、合、茄、跪、猛、庙、蹲、镇、须、揉、挨、挤、之、莲、胀、姿、仿、裳、翩、随、涛、依、否、窃、私、汪、类、镜、煤、属、珍、诊、职、扶、除、疑、效、缺、况、编、尝、传、延、庆、扬、叠、涌、股、螺、旋、桨、掠、励、顾、融、腾、掩、盗、铛、偷、碰、株、待、窜、撞、桩、捡、锄、魏、箭、猎、雁、弦、悲、惨、愈、痛",
                "1511,1300,832,1003,3267,3266,1079,2433,785,2477,2548,1474,105,473,1487,2056,691,160,1621,673,3473,1509,2722,656,1649,2185,875,474,1331,1224,1890,1572,3433,2049,559,1687,842,50,2242,2516,2836,276,192,828,2577,70,1737,518,561,881,2910,935,514,598,1640,2246,1697,2430,786,859,528,720,821,2316,17,1315,1175,706,757,560,2071,517,817,551,3252,1926,347,908,766,2252,1631,2219,3019,973,2650,410,442,251,726,1809,280,1571,831,1318,1561,3378,1317,2330,1012,1367,2425,1836,1127,2483,2399,2392,3046,500,1344,2069,307,621,860,612,2839,2044,3209,466,846,1590,3224,819,642,383,607,647,994,652,2938,2529,1478,2003,1800,532,1006,2230,856,750,3365,1436,550,2280,1002,455,610,771,1916,1264,568,734,1192,1055,646,1437,1125,1422,249,49,707,984,405,897,951,659,1663,1232,1661,1150,2824,597,2568,2848,2306,679,451,1360,631,624,245,3236,2974,68,742,814,1599,1837,714,1059,790,493,2933,966,30,2923,3390,1530,983,1842,921,1512,3303,433,869,2566,609,2715,1142,1648,2721,1875,1796,411,632,2309,2931,826,831,1579,1627,1209,1154,1939,658,510,585,847,1412,1301,1991,976,335,288,751,933,1810,957,1655,2999,894,741,1308,278,637,417,2201,1269,920,2347,2875,56,864,2017,2046,1368,203,1821,2361,1174,877,728,259,509,1976,59,849,696,1285,761,2619,1559,663,327,2909,1350,699,2283,35,2622,1820,1235,34,979,1923,722,649,2362,669,1154,822,2321,2868,519,2519,3385,376,537,1870,1054,1901,2787,3453,1001,3154,3485,3349,3276,2634,1694,1257,1732,1823,1738,614,1531,718,2581,3293,863,944,2213,930,1040,2659,1776,737,2033,2066,419,2065,1769,2354,2926,3003,3506,3507,1548,1108,3274,687,118,2752,251,1891,1731,1745,2162,2320,2513,2030,793,1172,1419,1068,1023,1361,902,2880,3394,2912,2291,3049,1736,2361,1181,1214,1847,2974,679,868,3010,1599,421,714,808,3215,788,1269,1041,575,872,1440,1993,803,2364,2719,2684,617,2324,3210,1628,2356,3024,1302,1739,2266,1450,1712,878,2769,2160,1678,1658,1954,2121,1563,1579,3031,2843,2140,1141,2009,3176,634,581,1970,2486,1710,3006,1365,2400,3425,82,2745,2048,1281,378,1546,2977,2525,1681,3463,3277,606,2664,2106,1808,129,2113,1665,1976,1225,3136,3322,455,2294,726,685,2021,1389,1442,418,3365,3050,797,873,1469,796,1288,626,64,2272,907,696,992,1867,392,1221,1243,1169,3086,2313,1666,3417,2541,2260,2378,1350,744,3350,3027,2367,2540,2475,2497,2946,2126,550,2863,3227,2131,2098,2764,3423,3287,2521,2707,1754,827,2586,3018,526");
        primarySchool[3] = new LearningList("小学四年级常用汉字生字表",
                "歇、联、雕、厘、甚、鼻、藏、概、淘、楚、侵、衅、驻、抗、鲁、绍、馆、戒、段、务、奔、厉、弛、忧、哀、持、慰、谜、梭、狂、赢、益、若、凳、锅、替、抄、印、嗓、捆、俯、投、轰、隆、爆、叨、役、营、占、攻、枪、怒、艰、牺、顽、暴、臂、规、膛、仇、鹭、含、岭、帝、辞、陵、猿、啼、殿、廊、漆、栏、昆、爽、阁、辉、煌、葱、朱、痕、堤、哄、驾、耀、亩、丈、拇、镰、笋、伏、丘、折、缝、抚、糖、配、饮、钟、程、闯、训、选、择、验、资、源、宋、拴、陷、论、尚、潜、舱、绳、绑、铲、拖、亚、匣、挖、鞋、锯、避、倍、庐、瀑、炉、潮、据、罩、薄、闷、沸、踮、犹、浩、崩、霎、余、恢、涨、虎、隙、拂、漾、柄、曲、逐、瞧、型、陈、搏、促、企、犯、罪、殊、夹、即、碎、改、集、付、启、抛、剧、翼、纵、跃、挣、距、丧、纽、抉、曾、践、获、堡、瘦、纠、掏、乞、轧、躺、饥、质、趵、纯、乏、藻、扁、崇、峻、蜿、蜒、砖、屯、垒、峭、凝、魄、惠、莺、郭、酒、哺、络、绎、桶、吱、旬、拐、缸、酬、俺、歉、仅、治、坦、谓、梯、坚、茏、览、械、愧、疚、嫌、辛、嗅、奈、绒、躯、拯、幼、浑、哑、搏、庞、愣、虑、凭、痒、稿、腔、要、摔、跌、胆、辟、遭、殃、责、倔、荒、忍、惫、牵、翘、鬼、吻、递、嘛、港、邦、芜、巫、婆、逼、扮、旱、绸、褂、徒、烦、饶、渠、灌、溉、吩、咐、茅、榨、价、榴、慕、矮、浙、罗、呈、郁、聚、适、昏、稍、额、估、损、皇、组、般、征、苏、宏、唐、凡、统、销、略、奉、执、维、予、素、浸、凯、遗、硕、贡、圣、协、吁、妻、充、孟、帆、唯、偶、鬓、衰、查、克、迫、睫、垫、泣、呜、咽、拳、竭、亿、抵、钢、兽、繁、殖、蔬、炭、蒸、杀、菌、预、疗、捷、购、屏、访、辅、邮、贺、羡、宜、恋、妙",
                "2971,515,3376,1845,594,3162,821,2938,13,2933,1935,2502,1771,1316,770,1774,698,1284,676,602,1571,1096,1267,1456,1969,510,3327,2604,2415,1414,3434,2286,705,3212,2765,2635,1297,630,2987,2091,2218,849,1575,2612,3476,1116,1401,932,1102,1301,967,2046,1766,2199,2075,3256,3441,840,3294,1056,3508,996,1614,653,3002,2345,3029,2749,3079,2537,3191,1837,1590,2425,1981,2718,3051,2673,1206,2536,2646,1873,1764,3481,1425,659,1534,3451,2208,1218,1125,1303,3088,1289,3385,2137,1423,542,557,1249,1146,499,1532,647,740,3054,1458,1802,2348,383,1588,3308,2228,2622,2055,2479,1517,443,1346,1810,957,2999,3395,2219,1430,3454,1703,3310,584,2989,3343,1437,1719,3509,1415,2300,2469,3353,887,2012,2310,1584,2881,1527,3196,1830,697,2145,3409,760,763,2907,1926,1229,882,955,2146,1185,376,2945,583,658,912,1463,1313,723,3442,1496,2449,1807,2446,1561,1501,3510,367,2735,669,2790,3179,1155,2376,1025,1101,3290,1138,701,3511,1492,1062,3460,2025,2470,2187,3512,2742,1844,1046,2054,2183,3381,3163,2695,2118,2264,533,2161,2062,1775,2414,1362,1236,1516,1915,2941,2212,3185,541,536,976,2602,2413,814,3513,1863,2404,2857,1684,3084,1432,2985,1570,2056,2500,1812,1156,2007,1874,2907,1680,2855,2151,1641,2535,3283,2808,105,3104,2737,1948,3080,3124,1857,792,2224,1821,903,2814,1854,2714,1934,1374,2293,3147,2832,1157,1325,1343,2574,2697,1307,1356,2625,3076,2225,2290,1963,2559,3491,2850,1372,1604,1549,3122,566,3120,3107,3001,2295,362,1358,1565,3106,846,1672,2777,3321,1390,2093,675,689,585,884,612,1459,2274,987,492,2762,2450,1502,1166,504,1081,877,2309,1615,817,2422,1298,748,1177,1195,477,712,1755,30,2460,2495,3478,2262,615,264,1647,2963,1806,1713,1375,1886,2284,3182,1027,1520,1907,2551,3426,2708,3234,1897,2930,777,2393,988,1428,2368,1619,2034,1264,2429,1367,2047,2826,1730,925,929");
        primarySchool[4] = new LearningList("小学五年级常用汉字生字表",
                "范、刹、镶、裹、泻、镀、润、杰、截、溢、则、燃、缘、溜、货、奏、衡、诵、杖、超、肌、拘、耽、误、哲、仪、悼、逝、餐、枣、搞、冠、骂、嚼、悟、摊、奥、咳、嗽、拄、槐、耐、挽、饰、腮、洲、陪、检、阅、矫、锁、暂、糕、阻、谊、捣、谣、侦、混、吵、耗、嫂、勒、骏、限、鞭、驰、蹄、茶、貌、杯、跤、尼、艇、叉、耸、寂、梁、寇、晋、挥、葛、尸、悬、崖、斩、磨、罢、豪、屈、沃、刘、龄、匪、拒、醉、剂、施、哼、晕、勉、堪、承、吟、残、瑟、捏、扭、胯、郑、拜、租、允、厨、颈、缚、稻、贼、畜、鲸、肢、滤、吨、肺、判、胎、宅、蔽、弃、慎、址、掘、搜、骤、糙、朴、燥、钳、嘻、舀、掺、逗、棍、逮、萝、卜、筷、哗、哇、托、批、糟、蹋、尔、肆、痰、核、呻、究、律、俊、俏、拢、添、沾、倦、谱、符、塞、笠、蓑、戈、晰、介、疆、萎、汲、赖、旦、番、锻、炼、雅、勃、艘、航、桅、撕、唬、龇、咧、鸥、瞄、莱、茵、幽、券、蜡、瞎、陌、盲、键、粼、缕、恬、汹、录、扣、潋、滟、亦、抹、置、载、循、昙、秉、秧、砸、忌、膑、瞪、惑、讥、讽、蔑、序、率、瑜、遣、渡、策、滔、眺、幔、遮、苇、硫、磺、缆、盔、骼、椎、颌、趾、炙、烤、栎、羚、鸵、椭、政、瞬、琥、珀、蝇、脂、掸、拭、辣、渗、澎、湃、黏、测、伍、坨、啸、劣、酷、袭、僵、倚、秃、塑、豹、覆、莹、援、妄、诡、溃、扯、撤、瓢、褐、聋、疯、委、钧、召、狈、赴、伦、典、纳、喻、曼、庸、捅、刁、罚、释、绪、漏、抑、榜、寄、噢、杈、监、笛、嗡、惧、凄、憋、惩、樱、狱",
                "784,1653,3501,3171,1715,3152,2306,970,3101,3062,398,3387,2896,3059,1644,1779,3374,2031,1340,856,1232,1521,2109,1006,2096,1128,2579,2097,904,1564,2913,2023,1887,3484,2315,2915,680,1894,3140,1522,2936,1852,2100,1676,3023,746,2349,2411,2280,2480,2763,2712,3386,1478,2340,2102,2873,1638,2561,1368,2067,2885,858,2357,1760,3445,1278,3357,1820,3165,1552,2978,478,2800,1036,2231,2591,2575,2588,2116,963,2669,1032,2439,2463,1577,3378,2182,3173,1751,1447,954,2958,2077,1294,3247,1685,1977,2178,2164,1953,2638,888,1371,1856,2897,2088,1320,3514,1695,1916,2203,1080,2702,2617,3087,3281,2188,2279,3377,1663,3055,1366,1662,909,1952,1258,3114,1433,3069,1295,2383,2652,3443,3384,1174,3437,2192,3258,2233,2384,2133,2687,2605,2392,1017,3009,1889,1872,805,915,3435,3415,208,2903,3041,2132,1601,551,778,1938,1925,1509,2554,1708,2220,3207,2491,906,3515,3516,1047,2726,1005,3477,2394,3517,2939,1105,2803,3151,1988,2713,1839,3292,2229,3518,3217,2454,3519,1877,1855,2962,995,1819,1903,1696,3143,3257,1757,1691,2998,3520,2894,2014,1449,800,1163,3521,3522,1244,1504,889,2084,2799,3523,1630,2205,2141,1476,3524,3413,2696,1076,1263,3111,1431,2542,3525,2979,2847,2782,3057,3526,3527,3175,1326,2706,3528,2889,2424,3529,2688,3530,2447,3531,2288,3532,2545,2253,2694,1793,3410,3533,3534,3144,2241,3535,1785,3180,2576,3309,2844,3536,2003,1217,3537,6,1194,3126,2427,3289,2211,1387,3048,2235,3447,2117,2654,1247,1742,2841,1296,3228,3351,3205,2426,1972,926,1911,1152,1416,1794,715,993,646,2748,2442,2538,2104,1019,1899,1004,2619,3197,1312,3121,2590,3538,3539,2152,2489,2986,2580,2259,3307,2797,3238,1958");
        primarySchool[5] = new LearningList("小学六年级常用汉字生字表",
                "厦、伐、综、砚、锤、焚、协、檐、汇、泽、宣、钮、徐、瞻、帜、袖、挪、谋、辈、脉、漓、澜、瑕、翡、峦、障、筏、绵、凌、酿、剥、妥、帖、藉、偿、馋、媒、诞、埃、渺、矿、赐、慷、慨、滥、睹、礴、丸、岷、咨、询、浏、碟、晖、迪、誉、篇、版、皱、歧、谨、巢、梢、暇、茸、甸、屑、掷、俗、瑞、兆、谚、枕、馒、柜、锈、摩、爹、袄、筒、揪、粥、吉、炕、叙、肤、签、缩、脾、册、熄、唉、欠、谅、俱、矣、曰、盂、沧、汤、阀、娱、僻、怖、宪、胖、刑、押、舅、绞、彻、迁、鸿、旺、标、炊、葬、权、溅、嘹、魅、萍、敏、滨、拆、申、挠、控、嘲、毅、扛、绘、桨、岔、竣、藐、蔡、羹、煎、诸、妒、督、寨、擂、呐、丞、璧、臣、诺、廉、颇、御、侮、辱、袍、荆、祭、乃、涕、洛、碗、伶、俐、徘、徊、裸、兜、蜷、焰、烘、哎、梗、填、橱、烁、魂、搁、帐、怨、掀、寡、揍、魁、霉、勺、熬、鼎、铸、铭、湛、昌、溶、构、寓、矛、盾、誉、吾、履、遂",
                "2703,1220,2626,1850,2995,2683,1177,3403,1142,1722,939,1913,5,3448,1612,2333,1811,2595,2715,1951,3060,3316,3540,3541,1967,3081,2785,2623,2258,3127,2341,1404,1611,3399,2494,2816,2883,1741,2105,2838,1567,2757,3198,2859,3056,2960,3542,1030,3543,1975,1743,2006,3129,3544,1598,3070,3288,1636,2255,1581,3075,2630,2409,2972,1814,1413,2343,2381,1931,2899,1228,2603,1560,3170,1554,2766,3297,2232,2026,2784,2651,2878,812,1701,1942,1661,3008,3214,2806,1135,3187,2180,1066,2338,2215,1488,1050,3545,1451,1256,1980,2350,3291,1725,2020,1950,1159,1514,3011,2063,1400,1211,2555,1589,710,1700,2667,769,2842,3261,3164,2398,2492,3064,1518,1107,1792,2382,3260,3304,1161,2059,2260,1406,2823,3401,3112,3474,3047,2329,1485,2956,3199,3333,1370,3546,3456,1175,938,3042,2616,2798,1929,2139,2334,1813,2526,1021,2308,905,2947,1395,1928,2503,1940,3077,2501,3547,2831,2289,1591,2407,2906,3347,1990,2902,2657,1383,1961,2374,3200,2636,3016,3254,1029,3095,2727,2759,2478,3548,1593,3065,1557,2862,1154,1939,3070,1347,3329,2830");

        return primarySchool;
    }
    public List getPositionByCharacter(String character,String pureContent)
    {
        List characterPositions = new ArrayList<Integer>();

        Pattern p = Pattern.compile(character);
        Matcher m = p.matcher(pureContent);
        while (m.find()) {
            characterPositions.add(m.start());
        }
        return characterPositions;
    }
    @Override
    protected void onPostExecute(Void result) {
        /*load ability test fragment*/
        Fragment fragment = new com.jinshu.xuzhi.learnchinese.FragmentCustomLearning();
        FragmentManager manager = mActivity.getSupportFragmentManager();
        FragmentTransaction transaction = manager.beginTransaction();
        transaction.replace(R.id.output, fragment);
        transaction.commit();

        /*ImageView study = (ImageView) ((ViewGroup) mActivity
                .findViewById(android.R.id.content)).findViewById(R.id.image_study);*/
        ImageView learned = (ImageView) ((ViewGroup) mActivity
                .findViewById(android.R.id.content)).findViewById(R.id.image_learned);
        ImageView courses = (ImageView) ((ViewGroup) mActivity
                .findViewById(android.R.id.content)).findViewById(R.id.image_courses);
        ImageView test = (ImageView) ((ViewGroup) mActivity
                .findViewById(android.R.id.content)).findViewById(R.id.image_test);
        //study.setImageResource(R.drawable.openbook_24);
        learned.setImageResource(R.drawable.blackflag_24);
        courses.setImageResource(R.drawable.addlist_green_24);
        test.setImageResource(R.drawable.books_24);
        Log.v(LOG_TAG, "load course list fragment");
    }
}